app/controllers/posts_controller.rb

SELECT "posts".* FROM "posts"
---
  def index
    @posts = Post.all.reverse

INSERT INTO "users" ("username", "email", "password", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["username", "jackie chan"], ["email", "jackie@chan.com"], ["password", "123chan"], ["created_at", "2019-01-07 18:45:04.345959"], ["updated_at", "2019-01-07 18:45:04.345959"]]
INSERT INTO "posts" ("title", "body", "user_id", "created_at", "updated_at", "author") VALUES (?, ?, ?, ?, ?, ?)  [["title", "sdfa"], ["body", "fads"], ["user_id", 1], ["created_at", "2019-01-09 18:51:30.166297"], ["updated_at", "2019-01-09 18:51:30.166297"], ["author", "fasd"]]
---
  def create
    Post.create(title: params[:title], body: params[:body], user_id: session[:user_id], author: params[:author])

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "posts" WHERE "posts"."id" = ?  [["id", 2]]
DELETE FROM "users" WHERE "users"."id" = ?  [["id", 2]]
---
  def destroy
    @post = Post.find(params[:id])
    if current_user.id == @post.user.id
        @post.destroy