app/controllers/users_controller.rb

INSERT INTO "users" ("username", "email", "created_at", "updated_at", "encrypted_password", "remember_token") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    User.create(username: params[:username], email: params[:email], password: params[:password])